"""
Είναι το βασικό module για την ανάλυση του πρωτοκόλλου της ΠΚΜ.
Η τεκμηρίωση και οι λόγοι για τη δημιουργία της εφαρμογής αναπτύσονται
στο αρχείο που έχω στο Google Drive.

2017-11-18
Από τη χθεσινή μέρα διαπίστωσα ότι το πρωτόκολλο έχει μια βασική αδυναμία
που έχει να κάνει ουσιαστικά με την πολλαπλή πρωτοκόλληση του ίδιου εγγράφου.
Συγκεκριμένα είδα στην πολιτική προστασία να πρωτοκολλούν έγγραφο δύο και τρεις
φορές όταν αυτό τους έχει ως αποδέκτες αλλά και όταν τους χρεώνεται από κάποιο
άλλο γραφείο όπςως περιφερειάρχη ή αντιπεριφερειάρχη. Το γεγονός αυτό μας
οδηγεί στην ανάγκη να πρέπει να μπορούμε να διερευνούμε τη διπλή πρωτοκόλληση
είτε μετά από αναζήτηση χειροκίνητη (κανένα νόημα όταν αυτό αφορά ήδη
καταχωρυμένα έγγραφα) ή να μπορέσουμε να χρησιμοποιούμε κάποιο μοναδικό
χαρακτησριστικό (πχ ΑΔΑ)
 """
